# FailedToChangeInstSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FailedToChangeInstSymbol Property
BuiltInFailures..::..WallFailures Class See Also
---
Failed to change symbol of instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToChangeInstSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToChangeInstSymbol As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToChangeInstSymbol {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace